core-price-cjdispositiva-v1/src/test/resources/__files/InviaPropostaV2-request.xml

<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:env="http://www.w3.org/2003/05/soap-envelope">
   <S:Header>
      <ns2:ISPWebservicesHeader xmlns:ns0="http://ws.price.isp.com/proposteCJPOS/" xmlns:ns1="http://ws.price.isp.com/proposte/" xmlns:ns2="http://intesasanpaolo.it/">
         <RequestInfo>
            <TransactionId>NPUA020200417GEN00164904998</TransactionId>
            <Timestamp>1587135953280</Timestamp>
            <ServiceID>GESTCJPOSV</ServiceID>
            <ServiceVersion>00</ServiceVersion>
            <Language>I</Language>
         </RequestInfo>
         <OperatorInfo UserID="U004835" IsVirtualUser="false"/>
         <CompanyInfo>
            <ISPCallerCompanyIDCode>01</ISPCallerCompanyIDCode>
            <ISPBranchCode>01383</ISPBranchCode>
            <ISPServiceCompanyIDCode>01</ISPServiceCompanyIDCode>
         </CompanyInfo>
         <BusinessInfo>
            <CustomerID>0002896811838000</CustomerID>
            <BusinessProcessName>anonym</BusinessProcessName>
            <BusinessProcessID>anonym</BusinessProcessID>
            <BusinessOperation>anonym</BusinessOperation>
            <BusinessFileID>anonym</BusinessFileID>
         </BusinessInfo>
         <TechnicalInfo>
            <ChannelIDCode>31</ChannelIDCode>
            <ApplicationID>NPUC0</ApplicationID>
            <CallerServerName>salclp8940</CallerServerName>
            <CallerProgramName>NPUC0</CallerProgramName>
         </TechnicalInfo>
         <AdditionalBusinessInfo>
            <Param Name="CodABI" Value="01025"/>
            <Param Name="CodUnitaOperativa" Value="01383"/>
            <Param Name="CodOperativita" Value="0"/>
            <Param Name="DataContabile" Value="17042020"/>
         </AdditionalBusinessInfo>
      </ns2:ISPWebservicesHeader>
   </S:Header>
   <S:Body>
      <ns0:inviaPropostaV2 xmlns:ns0="http://ws.price.isp.com/proposteCJPOS/" xmlns:ns1="http://ws.price.isp.com/proposte/" xmlns:ns2="http://intesasanpaolo.it/">
         <ns0:datiProposta>
            <ns0:tipoChiamata>INS</ns0:tipoChiamata>
            <ns0:codiceOrigine>IN</ns0:codiceOrigine>
            <ns0:rapportoReale>11653632401932571</ns0:rapportoReale>
            <ns0:attributoRapporto>RB6324</ns0:attributoRapporto>
            <!--lista dei profili in input al momento ignorata <ns0:profili>YAP9C1</ns0:profili>-->
            <ns0:datiProposta>
               <ns0:codiceAbiProposta>01025</ns0:codiceAbiProposta>
               <ns0:annoProposta>2020</ns0:annoProposta>
               <ns0:codiceTipoOperazione>N</ns0:codiceTipoOperazione>
               <ns0:codiceOggettoProposta>01</ns0:codiceOggettoProposta>
               <ns0:attributo>RB6324</ns0:attributo>
               <ns0:matricolaProponente>U004835</ns0:matricolaProponente>
               <!--U004835 Avonto Giovanni : UO: 01383-->
               <ns0:uoProponente>01383</ns0:uoProponente>
            </ns0:datiProposta>
            <ns0:datiCliente>
               <ns0:abiCliente>01025</ns0:abiCliente>
               <ns0:ndgCliente>2896811838000</ns0:ndgCliente>
               <ns0:pivaCliente>02417880032</ns0:pivaCliente>
               <ns0:uoGestore>01383</ns0:uoGestore>
               <ns0:nominativoCliente>DE AGOSTINI POLSKA SP. Z O.O.</ns0:nominativoCliente>
            </ns0:datiCliente>
            <ns0:attributiPricing/>
            <ns0:listaCondizioni>
               <ns0:codiceCondizione>03229</ns0:codiceCondizione>
               <ns0:tipoDeroga>N</ns0:tipoDeroga>
               <ns0:tipoValore>1</ns0:tipoValore>
               <ns0:indPresenzaValProp>S</ns0:indPresenzaValProp>
               <ns0:valoreProposto>100</ns0:valoreProposto>
            </ns0:listaCondizioni>
         </ns0:datiProposta>
      </ns0:inviaPropostaV2>
   </S:Body>
</S:Envelope>
